const base = 1000;

const zeroFa = 'سفر';

const endsWithAnd = ' و ';

const scale = ['', 'هەزار', 'ملیۆن', 'ملیارد'];

const numberToWord = {
  0: '',
  1: 'یەک',
  2: 'دوو',
  3: 'سێ',
  4: 'چوار',
  5: 'پێنج',
  6: 'شەش',
  7: 'حەوت',
  8: 'هەشت',
  9: 'نۆ',
  10: 'دە',
  11: 'یازده',
  12: 'دوازده',
  13: 'سێزدە',
  14: 'چواردە',
  15: 'پازدە',
  16: 'شازدە',
  17: 'حەڤدە',
  18: 'هەژدە',
  19: 'نۆزدە',
  20: 'بیست',
  30: 'سی',
  40: 'چل',
  50: 'پەنجا',
  60: 'شەست',
  70: 'حەفتا',
  80: 'هەشتا',
  90: 'نەوەد',
  100: 'سەد',
  200: 'دوو سەد',
  300: 'سێ سەد',
  400: 'چوار سەد',
  500: 'پێنج سەد',
  600: 'شەش سەد',
  700: 'حەوت سەد',
  800: 'هەشت سەد',
  900: 'نۆ سەد',
};
